/*******************************************************************************
 * XFilter.h
 *
 * Created on: 2024.10.20
 * Author    : RND. Kang PilSoon.
 *
 *  - Butterworth 필터와, 칼만 필터 관련 파일을 제공함.
 *
 ******************************************************************************/
#ifndef XFILTER_H_
#define XFILTER_H_
#include <math.h>

/*****************************************************************************
 * 1. saturation function 관련
 ******************************************************************************/
#define Xsat_sigmoidlike(_x_, _delta_) (_x_ / (fabsf(_x_) + _delta_))

/*****************************************************************************
 * 2. 1차 저역통과 Filter 관련
 ******************************************************************************/
/* 1차 저역통과 필터로서, 필터링된 신호를 시간에 따라 부드럽게 변화시키는 데 사용
 *  -물리적으로는 아날로그 RC 저역통과 필터의 미분방정식을 이산화(descretization)한 형태임.
 *  -컷오프 주파수(f)가 높을수록 필터가 더 빠르게 반응하며, 낮을수록 더 부드러운 필터링이 됨.
 *  -콘덴서에서 전압이 천천히 충전되는 것과 같은 원리
 *******************************************************************************/
// [INPUT]
//  _input_    : 현재 입력 값. 필터를 통해서 처리될 원본 값.
//  _preOutput_: 이전 출력 값. LPF의 이전 상태를 나타내며, 현재 필터링된 출력을 계산하는 데 사용됨.
//  _f_        : 필터의 컷오프 주파수(Hz). 값이 클수록 빠르게 반응하고, 값이 작을수록 더 부드러운 필터링이 됨.
//  _dt_       : 샘플링 시간 간격으로, 타이머 주기나 루프 주기 등을 통해 얻어진 시간 값임.
// [설명]
//             :  2.0f * 3.141592f * _f_ * _dt_: 필터의 반응 정도를 나타내는 상수를 계산.
//                여기서 2πf는 필터의 컷오프 주파수에 기반한 이득(Gain)
//                K=2πf*dt는 샘플링 시간 간격에 따른 이득의 조정값.
//                0 < K < 1 범위 내에서 동작함.
//             : 필터링된 출력은 이전 출력 값에 이득과 현재 입력 값과의 차이를 곱한 값을 더하여 계산됨.
//             : 이 방식은 필터가 현재 입력 값에 빠르게 반응하면서도 이전 상태를 고려하여 부드러운 변화를 유지하도록 함.
#define calcLPF(_input_, _preOutput_, _f_, _dt_) (_preOutput_ + 2.0f * 3.141592f * _f_ * _dt_ * (_input_ - _preOutput_))

/*****************************************************************************
 * 3. ButterWorth Low-Pass Filter 관련 : 2dn 시스템으로 설계, Canonical Form II
 ******************************************************************************/
typedef struct
{
    float a[3];
    float b[3];
    float x[3]; // Raw data
    float y[3]; // Filtered data
} tsFilterState;

void ButterworthFilter_Init(tsFilterState *filter, float cutoff_frequency, float sampling_frequency);
float ButterworthFilter_LowPass(tsFilterState *filter, float input);

/*****************************************************************************
 * 4. 칼만 Filter 관련
 *   1) Q << R : 시스템은 안정, 센서는 noisy
 *    --> 많이 필터링됨 (부드러움)
 *
 *    2) Q >> R : 시스템은 급변, 센서는 믿음
 *    --> 거의 raw 값
 ******************************************************************************/
/* 4-1. 1차원 상태처리 로직 */
typedef struct
{
    float x; // 현재 상태 (예: 온도, 습도, CO2)
    float P; // 공분산(시스템의 불확실 정도), 초기 불확실성,
             // -P가 클수록 측정값에 더 민감하게 반응(노이즈가 클 때 유리, 초기값을 못믿음)
             // -P가 작을수록 예측값에 더 의존(노이즈가 작을 때 유리, 초기값을 신뢰함)
             // -주로 1.0f를 많이 사용, 시스템 특성에 따라 조정 필요
    float Q; // 프로세스 노이즈 공분산
             // -시스템 모델의 불확실성을 나타냄
             // -Q가 클수록 시스템 변화에 더 민감하게 반응
             // -Q가 작을수록 시스템 변화에 덜 민감하게 반응
             // -Q는 시스템의 동적 특성에 따라 조정
             //  -예: 온도 변화가 빠른 시스템에서는 Q를 크게 설정
             //      반면, 천천히 변화하는 시스템에서는 Q를 작게 설정
             // -Q는 경험적 조정이 필요
             //  -시스템의 실제 동작을 관찰하여 최적의 값을 찾음
             //  -Q가 너무 크면 노이즈에 민감해지고, 너무 작으면 변화에 둔감해짐
             //  -적절한 Q 값은 시스템의 특성과 요구사항에 따라 다름
             //  -실험과 조정을 통해 최적의 값을 찾아야 함
             //  -일반적으로 Q는 시스템의 변화율과 노이즈 수준에 따라 결정
             //  -시스템이 빠르게 변화하면 Q를 크게, 천천히 변화하면 Q를 작게 설정
             //  -노이즈가 많으면 Q를 크게, 노이즈가 적으면 Q를 작게 설정
    float R; // 측정 노이즈 공분산, 센서 신뢰도(센서 흔들림)
             // -측정값의 불확실성을 나타냄
             // -R이 클수록 측정값에 덜 민감하게 반응
             // -R이 작을수록 측정값에 더 민감하게 반응
             // -R는 센서의 특성에 따라 조정
             //  -예: 노이즈가 많은 센서에서는 R를 크게 설정
             //      노이즈가 적은 센서에서는 R를 작게 설정
             // -R는 경험적 조정이 필요
             //  -센서의 실제 동작을 관찰하여 최적의 값을 찾음
             //  -R가 너무 크면 측정값을 무시하게 되고, 너무 작으면 노이즈에 민감해짐
             //  -적절한 R 값은 센서의 특성과 요구사항에 따라 다름
             //  -실험과 조정을 통해 최적의 값을 찾아야 함
             //  -일반적으로 R는 센서의 노이즈 수준에 따라 결정
             //  -노이즈가 많으면 R를 크게, 노이즈가 적으면 R를 작게 설정
    float K; // 칼만 이득
             // -칼만 필터가 예측값과 측정값 간의 균형을 맞추는 정도를 나타냄
             // -K가 클수록 측정값에 더 의존
             // -K가 작을수록 예측값에 더 의존
             // -K는 매 업데이트마다 계산되며, 현재 공분산(P)와 측정 노이즈 공분산(R)에 따라 결정
} tsKalmanFilter;

void Kalman_init(tsKalmanFilter *kf, float initial_x, float initial_P, float Q, float R);
float Kalman_update(tsKalmanFilter *kf, float measurement);            // dt 가 일정 할때 사용
float Kalman_update2(tsKalmanFilter *kf, float measurement, float dt); // dt 가 일정 하지 않을때 사용

/*****************************************************************************
 * 5. Moving Average Filter
 ******************************************************************************/
#define MA_MAX_WINDOW_SIZE   50   // 최대 허용 크기 (원하는 값)

typedef struct
{
    float buffer[MA_MAX_WINDOW_SIZE];
    int windowSize;   // 실제 사용할 평균 개수 
    int index;
    int count;
    float sum;
} tsMovingAverageFilter;

void MovingAverageFilter_Init(tsMovingAverageFilter *f, int windowSize);
float MovingAverageFilter_Update(tsMovingAverageFilter *f, float input);
#endif /* XFILTER_H_ */